In [22]:
import pandas as pd
import numpy as np

In [23]:
pd.read_csv('D:\DS  ML NLP and dL\Data Analysis\example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
df=pd.read_csv('D:\DS  ML NLP and dL\Data Analysis\example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
df.to_csv('My_output',index=False)

In [26]:
pd.read_csv('My_Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [28]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [30]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [32]:
data=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list')

In [37]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [39]:
from sqlalchemy import create_engine

In [41]:
engine=create_engine('sqlite:///:memory:')

In [46]:
df.to_sql('my_tables',engine)

4

In [48]:
sqldf=pd.read_sql('My_tables',con=engine)

InvalidRequestError: Could not reflect: requested table(s) not available in Engine(sqlite:///:memory:): (My_tables)

In [49]:
sqldf

NameError: name 'sqldf' is not defined

In [18]:
#pip install xlrd

Collecting xlrdNote: you may need to restart the kernel to use updated packages.

  Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
     ---------------------------------------- 0.0/96.5 kB ? eta -:--:--
     -------------------------------------- - 92.2/96.5 kB 2.6 MB/s eta 0:00:01
     ---------------------------------------- 96.5/96.5 kB 1.8 MB/s eta 0:00:00
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [20]:
#pip  install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.1-py2.py3-none-any.whl (249 kB)
     ---------------------------------------- 0.0/249.8 kB ? eta -:--:--
     ------------------ ------------------- 122.9/249.8 kB 2.4 MB/s eta 0:00:01
     -------------------------------------  245.8/249.8 kB 2.5 MB/s eta 0:00:01
     -------------------------------------- 249.8/249.8 kB 2.2 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.1
Note: you may need to restart the kernel to use updated packages.